# 2012~2024을 유저에게 입력을 받으면 해당 띠를 출력하는 프로그램
'''
zodiacSign = {
    2012 :'용띠',
    2013:'뱀띠',
    2014:'말띠',
    2015:'양띠',
    2016:'원숭이띠',
    2017:'닭띠',
    2018:'개띠',
    2019:'돼지띠',
    2020:'쥐띠',
    2021:'소띠',
    2022:'호랑이띠',
    2023:'토끼띠',
    2024: '용띠'
}

year = int(input("2012~2024년 중 입력하시오:"))
print(f"{year}년 생은 { zodiacSign[ year ]}입니다.")

'''


#저번시간처럼 리스트로 하고시픙ㄴ덷ㅇ

a = """2012 :'용띠',
    2013:'뱀띠',
    2014:'말띠',
    2015:'양띠',
    2016:'원숭이띠',
    2017:'닭띠',
    2018:'개띠',
    2019:'돼지띠',
    2020:'쥐띠',
    2021:'소띠',
    2022:'호랑이띠',
    2023:'토끼띠',
    2024: '용띠'
}"""
a = a.split(":")
a = a.split(",")
print(a)